camel-springboot-exercise-2/data/Mensaje - ValidaciónSaldos.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <prcFdValidarSaldoElement xmlns="http://fiduprod/WsFXF.wsdl/types/">
      <moviCtcoNegocio>GL185</moviCtcoNegocio>
      <moviCtcoCiasNego>CCAEV</moviCtcoCiasNego>
      <moviEncargo>14857</moviEncargo>
    </prcFdValidarSaldoElement>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
